bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
/**
  ******************************************************************************
  * @file    rf_fpga_reg.h
  * @version V1.2
  * @date    2019-09-25
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __RF_FPGA_REG_H__
#define __RF_FPGA_REG_H__

#include "bl702.h"

/* 0x600 : rf_fpga_ctrl_0 */
#define RF_FPGA_CTRL_0_OFFSET            (0x600)
#define RF_FPGA_RF_FSM_ST_CCI_4S         RF_FPGA_RF_FSM_ST_CCI_4S
#define RF_FPGA_RF_FSM_ST_CCI_4S_POS     (0U)
#define RF_FPGA_RF_FSM_ST_CCI_4S_LEN     (5U)
#define RF_FPGA_RF_FSM_ST_CCI_4S_MSK     (((1U << RF_FPGA_RF_FSM_ST_CCI_4S_LEN) - 1) << RF_FPGA_RF_FSM_ST_CCI_4S_POS)
#define RF_FPGA_RF_FSM_ST_CCI_4S_UMSK    (~(((1U << RF_FPGA_RF_FSM_ST_CCI_4S_LEN) - 1) << RF_FPGA_RF_FSM_ST_CCI_4S_POS))
#define RF_FPGA_RF_FSM_ST_CCI_4S_EN      RF_FPGA_RF_FSM_ST_CCI_4S_EN
#define RF_FPGA_RF_FSM_ST_CCI_4S_EN_POS  (5U)
#define RF_FPGA_RF_FSM_ST_CCI_4S_EN_LEN  (1U)
#define RF_FPGA_RF_FSM_ST_CCI_4S_EN_MSK  (((1U << RF_FPGA_RF_FSM_ST_CCI_4S_EN_LEN) - 1) << RF_FPGA_RF_FSM_ST_CCI_4S_EN_POS)
#define RF_FPGA_RF_FSM_ST_CCI_4S_EN_UMSK (~(((1U << RF_FPGA_RF_FSM_ST_CCI_4S_EN_LEN) - 1) << RF_FPGA_RF_FSM_ST_CCI_4S_EN_POS))
#define RF_FPGA_RF_FSM_EN                RF_FPGA_RF_FSM_EN
#define RF_FPGA_RF_FSM_EN_POS            (16U)
#define RF_FPGA_RF_FSM_EN_LEN            (1U)
#define RF_FPGA_RF_FSM_EN_MSK            (((1U << RF_FPGA_RF_FSM_EN_LEN) - 1) << RF_FPGA_RF_FSM_EN_POS)
#define RF_FPGA_RF_FSM_EN_UMSK           (~(((1U << RF_FPGA_RF_FSM_EN_LEN) - 1) << RF_FPGA_RF_FSM_EN_POS))
#define RF_FPGA_RF_FSM_STATE_CCI         RF_FPGA_RF_FSM_STATE_CCI
#define RF_FPGA_RF_FSM_STATE_CCI_POS     (23U)
#define RF_FPGA_RF_FSM_STATE_CCI_LEN     (5U)
#define RF_FPGA_RF_FSM_STATE_CCI_MSK     (((1U << RF_FPGA_RF_FSM_STATE_CCI_LEN) - 1) << RF_FPGA_RF_FSM_STATE_CCI_POS)
#define RF_FPGA_RF_FSM_STATE_CCI_UMSK    (~(((1U << RF_FPGA_RF_FSM_STATE_CCI_LEN) - 1) << RF_FPGA_RF_FSM_STATE_CCI_POS))
#define RF_FPGA_RF_FSM_PU_RX_EN          RF_FPGA_RF_FSM_PU_RX_EN
#define RF_FPGA_RF_FSM_PU_RX_EN_POS      (28U)
#define RF_FPGA_RF_FSM_PU_RX_EN_LEN      (1U)
#define RF_FPGA_RF_FSM_PU_RX_EN_MSK      (((1U << RF_FPGA_RF_FSM_PU_RX_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_RX_EN_POS)
#define RF_FPGA_RF_FSM_PU_RX_EN_UMSK     (~(((1U << RF_FPGA_RF_FSM_PU_RX_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_RX_EN_POS))
#define RF_FPGA_RF_FSM_PU_TX_EN          RF_FPGA_RF_FSM_PU_TX_EN
#define RF_FPGA_RF_FSM_PU_TX_EN_POS      (29U)
#define RF_FPGA_RF_FSM_PU_TX_EN_LEN      (1U)
#define RF_FPGA_RF_FSM_PU_TX_EN_MSK      (((1U << RF_FPGA_RF_FSM_PU_TX_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_TX_EN_POS)
#define RF_FPGA_RF_FSM_PU_TX_EN_UMSK     (~(((1U << RF_FPGA_RF_FSM_PU_TX_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_TX_EN_POS))
#define RF_FPGA_RF_FSM_PU_LO_EN          RF_FPGA_RF_FSM_PU_LO_EN
#define RF_FPGA_RF_FSM_PU_LO_EN_POS      (30U)
#define RF_FPGA_RF_FSM_PU_LO_EN_LEN      (1U)
#define RF_FPGA_RF_FSM_PU_LO_EN_MSK      (((1U << RF_FPGA_RF_FSM_PU_LO_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_LO_EN_POS)
#define RF_FPGA_RF_FSM_PU_LO_EN_UMSK     (~(((1U << RF_FPGA_RF_FSM_PU_LO_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_LO_EN_POS))
#define RF_FPGA_RF_FSM_PU_SB_EN          RF_FPGA_RF_FSM_PU_SB_EN
#define RF_FPGA_RF_FSM_PU_SB_EN_POS      (31U)
#define RF_FPGA_RF_FSM_PU_SB_EN_LEN      (1U)
#define RF_FPGA_RF_FSM_PU_SB_EN_MSK      (((1U << RF_FPGA_RF_FSM_PU_SB_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_SB_EN_POS)
#define RF_FPGA_RF_FSM_PU_SB_EN_UMSK     (~(((1U << RF_FPGA_RF_FSM_PU_SB_EN_LEN) - 1) << RF_FPGA_RF_FSM_PU_SB_EN_POS))

/* 0x604 : rf_fpga_ctrl_1 */
#define RF_FPGA_CTRL_1_OFFSET           (0x604)
#define RF_FPGA_RF_FSM_CCI_WR_TIME      RF_FPGA_RF_FSM_CCI_WR_TIME
#define RF_FPGA_RF_FSM_CCI_WR_TIME_POS  (0U)
#define RF_FPGA_RF_FSM_CCI_WR_TIME_LEN  (12U)
#define RF_FPGA_RF_FSM_CCI_WR_TIME_MSK  (((1U << RF_FPGA_RF_FSM_CCI_WR_TIME_LEN) - 1) << RF_FPGA_RF_FSM_CCI_WR_TIME_POS)
#define RF_FPGA_RF_FSM_CCI_WR_TIME_UMSK (~(((1U << RF_FPGA_RF_FSM_CCI_WR_TIME_LEN) - 1) << RF_FPGA_RF_FSM_CCI_WR_TIME_POS))
#define RF_FPGA_RF_FSM_LO_TIME          RF_FPGA_RF_FSM_LO_TIME
#define RF_FPGA_RF_FSM_LO_TIME_POS      (16U)
#define RF_FPGA_RF_FSM_LO_TIME_LEN      (12U)
#define RF_FPGA_RF_FSM_LO_TIME_MSK      (((1U << RF_FPGA_RF_FSM_LO_TIME_LEN) - 1) << RF_FPGA_RF_FSM_LO_TIME_POS)
#define RF_FPGA_RF_FSM_LO_TIME_UMSK     (~(((1U << RF_FPGA_RF_FSM_LO_TIME_LEN) - 1) << RF_FPGA_RF_FSM_LO_TIME_POS))

