bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
/* 0x608 : rf_fpga_ctrl_2 */
#define RF_FPGA_CTRL_2_OFFSET           (0x608)
#define RF_FPGA_RF_FSM_DLY_30_TIME      RF_FPGA_RF_FSM_DLY_30_TIME
#define RF_FPGA_RF_FSM_DLY_30_TIME_POS  (0U)
#define RF_FPGA_RF_FSM_DLY_30_TIME_LEN  (12U)
#define RF_FPGA_RF_FSM_DLY_30_TIME_MSK  (((1U << RF_FPGA_RF_FSM_DLY_30_TIME_LEN) - 1) << RF_FPGA_RF_FSM_DLY_30_TIME_POS)
#define RF_FPGA_RF_FSM_DLY_30_TIME_UMSK (~(((1U << RF_FPGA_RF_FSM_DLY_30_TIME_LEN) - 1) << RF_FPGA_RF_FSM_DLY_30_TIME_POS))
#define RF_FPGA_RF_FSM_DLY_01_TIME      RF_FPGA_RF_FSM_DLY_01_TIME
#define RF_FPGA_RF_FSM_DLY_01_TIME_POS  (16U)
#define RF_FPGA_RF_FSM_DLY_01_TIME_LEN  (12U)
#define RF_FPGA_RF_FSM_DLY_01_TIME_MSK  (((1U << RF_FPGA_RF_FSM_DLY_01_TIME_LEN) - 1) << RF_FPGA_RF_FSM_DLY_01_TIME_POS)
#define RF_FPGA_RF_FSM_DLY_01_TIME_UMSK (~(((1U << RF_FPGA_RF_FSM_DLY_01_TIME_LEN) - 1) << RF_FPGA_RF_FSM_DLY_01_TIME_POS))

/* 0x60C : rf_fpga_ctrl_3 */
#define RF_FPGA_CTRL_3_OFFSET     (0x60C)
#define RF_FPGA_RF_FSM_PU_SB      RF_FPGA_RF_FSM_PU_SB
#define RF_FPGA_RF_FSM_PU_SB_POS  (0U)
#define RF_FPGA_RF_FSM_PU_SB_LEN  (32U)
#define RF_FPGA_RF_FSM_PU_SB_MSK  (((1U << RF_FPGA_RF_FSM_PU_SB_LEN) - 1) << RF_FPGA_RF_FSM_PU_SB_POS)
#define RF_FPGA_RF_FSM_PU_SB_UMSK (~(((1U << RF_FPGA_RF_FSM_PU_SB_LEN) - 1) << RF_FPGA_RF_FSM_PU_SB_POS))

/* 0x610 : rf_fpga_ctrl_4 */
#define RF_FPGA_CTRL_4_OFFSET     (0x610)
#define RF_FPGA_RF_FSM_PU_LO      RF_FPGA_RF_FSM_PU_LO
#define RF_FPGA_RF_FSM_PU_LO_POS  (0U)
#define RF_FPGA_RF_FSM_PU_LO_LEN  (32U)
#define RF_FPGA_RF_FSM_PU_LO_MSK  (((1U << RF_FPGA_RF_FSM_PU_LO_LEN) - 1) << RF_FPGA_RF_FSM_PU_LO_POS)
#define RF_FPGA_RF_FSM_PU_LO_UMSK (~(((1U << RF_FPGA_RF_FSM_PU_LO_LEN) - 1) << RF_FPGA_RF_FSM_PU_LO_POS))

/* 0x614 : rf_fpga_ctrl_5 */
#define RF_FPGA_CTRL_5_OFFSET     (0x614)
#define RF_FPGA_RF_FSM_PU_TX      RF_FPGA_RF_FSM_PU_TX
#define RF_FPGA_RF_FSM_PU_TX_POS  (0U)
#define RF_FPGA_RF_FSM_PU_TX_LEN  (32U)
#define RF_FPGA_RF_FSM_PU_TX_MSK  (((1U << RF_FPGA_RF_FSM_PU_TX_LEN) - 1) << RF_FPGA_RF_FSM_PU_TX_POS)
#define RF_FPGA_RF_FSM_PU_TX_UMSK (~(((1U << RF_FPGA_RF_FSM_PU_TX_LEN) - 1) << RF_FPGA_RF_FSM_PU_TX_POS))

/* 0x618 : rf_fpga_ctrl_6 */
#define RF_FPGA_CTRL_6_OFFSET     (0x618)
#define RF_FPGA_RF_FSM_PU_RX      RF_FPGA_RF_FSM_PU_RX
#define RF_FPGA_RF_FSM_PU_RX_POS  (0U)
#define RF_FPGA_RF_FSM_PU_RX_LEN  (32U)
#define RF_FPGA_RF_FSM_PU_RX_MSK  (((1U << RF_FPGA_RF_FSM_PU_RX_LEN) - 1) << RF_FPGA_RF_FSM_PU_RX_POS)
#define RF_FPGA_RF_FSM_PU_RX_UMSK (~(((1U << RF_FPGA_RF_FSM_PU_RX_LEN) - 1) << RF_FPGA_RF_FSM_PU_RX_POS))

/* 0x61C : rf_fpga_ctrl_7 */
#define RF_FPGA_CTRL_7_OFFSET  (0x61C)
#define RF_FPGA_IDAC_CW_0      RF_FPGA_IDAC_CW_0
#define RF_FPGA_IDAC_CW_0_POS  (21U)
#define RF_FPGA_IDAC_CW_0_LEN  (5U)
#define RF_FPGA_IDAC_CW_0_MSK  (((1U << RF_FPGA_IDAC_CW_0_LEN) - 1) << RF_FPGA_IDAC_CW_0_POS)
#define RF_FPGA_IDAC_CW_0_UMSK (~(((1U << RF_FPGA_IDAC_CW_0_LEN) - 1) << RF_FPGA_IDAC_CW_0_POS))

/* 0x620 : rf_fpga_table_0 */
#define RF_FPGA_TABLE_0_OFFSET (0x620)
#define RF_FPGA_SDMIN_0        RF_FPGA_SDMIN_0
#define RF_FPGA_SDMIN_0_POS    (0U)
#define RF_FPGA_SDMIN_0_LEN    (30U)
#define RF_FPGA_SDMIN_0_MSK    (((1U << RF_FPGA_SDMIN_0_LEN) - 1) << RF_FPGA_SDMIN_0_POS)
#define RF_FPGA_SDMIN_0_UMSK   (~(((1U << RF_FPGA_SDMIN_0_LEN) - 1) << RF_FPGA_SDMIN_0_POS))

/* 0x624 : rf_fpga_table_1 */
#define RF_FPGA_TABLE_1_OFFSET (0x624)
#define RF_FPGA_SDMIN_1        RF_FPGA_SDMIN_1
#define RF_FPGA_SDMIN_1_POS    (0U)
#define RF_FPGA_SDMIN_1_LEN    (30U)
#define RF_FPGA_SDMIN_1_MSK    (((1U << RF_FPGA_SDMIN_1_LEN) - 1) << RF_FPGA_SDMIN_1_POS)
#define RF_FPGA_SDMIN_1_UMSK   (~(((1U << RF_FPGA_SDMIN_1_LEN) - 1) << RF_FPGA_SDMIN_1_POS))

/* 0x628 : rf_fpga_table_2 */
#define RF_FPGA_TABLE_2_OFFSET (0x628)
#define RF_FPGA_SDMIN_2        RF_FPGA_SDMIN_2
#define RF_FPGA_SDMIN_2_POS    (0U)
#define RF_FPGA_SDMIN_2_LEN    (30U)
#define RF_FPGA_SDMIN_2_MSK    (((1U << RF_FPGA_SDMIN_2_LEN) - 1) << RF_FPGA_SDMIN_2_POS)
#define RF_FPGA_SDMIN_2_UMSK   (~(((1U << RF_FPGA_SDMIN_2_LEN) - 1) << RF_FPGA_SDMIN_2_POS))

/* 0x62C : rf_fpga_table_3 */
#define RF_FPGA_TABLE_3_OFFSET (0x62C)
#define RF_FPGA_SDMIN_3        RF_FPGA_SDMIN_3
#define RF_FPGA_SDMIN_3_POS    (0U)
#define RF_FPGA_SDMIN_3_LEN    (30U)
#define RF_FPGA_SDMIN_3_MSK    (((1U << RF_FPGA_SDMIN_3_LEN) - 1) << RF_FPGA_SDMIN_3_POS)
#define RF_FPGA_SDMIN_3_UMSK   (~(((1U << RF_FPGA_SDMIN_3_LEN) - 1) << RF_FPGA_SDMIN_3_POS))

/* 0x630 : rf_fpga_table_4 */
#define RF_FPGA_TABLE_4_OFFSET (0x630)
#define RF_FPGA_SDMIN_4        RF_FPGA_SDMIN_4
#define RF_FPGA_SDMIN_4_POS    (0U)
#define RF_FPGA_SDMIN_4_LEN    (30U)
#define RF_FPGA_SDMIN_4_MSK    (((1U << RF_FPGA_SDMIN_4_LEN) - 1) << RF_FPGA_SDMIN_4_POS)
#define RF_FPGA_SDMIN_4_UMSK   (~(((1U << RF_FPGA_SDMIN_4_LEN) - 1) << RF_FPGA_SDMIN_4_POS))

/* 0x634 : rf_fpga_table_5 */
#define RF_FPGA_TABLE_5_OFFSET (0x634)
#define RF_FPGA_SDMIN_5        RF_FPGA_SDMIN_5
#define RF_FPGA_SDMIN_5_POS    (0U)
#define RF_FPGA_SDMIN_5_LEN    (30U)
#define RF_FPGA_SDMIN_5_MSK    (((1U << RF_FPGA_SDMIN_5_LEN) - 1) << RF_FPGA_SDMIN_5_POS)
#define RF_FPGA_SDMIN_5_UMSK   (~(((1U << RF_FPGA_SDMIN_5_LEN) - 1) << RF_FPGA_SDMIN_5_POS))

/* 0x638 : rf_fpga_table_6 */
#define RF_FPGA_TABLE_6_OFFSET (0x638)
#define RF_FPGA_SDMIN_6        RF_FPGA_SDMIN_6
#define RF_FPGA_SDMIN_6_POS    (0U)
#define RF_FPGA_SDMIN_6_LEN    (30U)
#define RF_FPGA_SDMIN_6_MSK    (((1U << RF_FPGA_SDMIN_6_LEN) - 1) << RF_FPGA_SDMIN_6_POS)
#define RF_FPGA_SDMIN_6_UMSK   (~(((1U << RF_FPGA_SDMIN_6_LEN) - 1) << RF_FPGA_SDMIN_6_POS))

/* 0x63C : rf_fpga_table_7 */
#define RF_FPGA_TABLE_7_OFFSET (0x63C)
#define RF_FPGA_SDMIN_7        RF_FPGA_SDMIN_7
#define RF_FPGA_SDMIN_7_POS    (0U)
#define RF_FPGA_SDMIN_7_LEN    (30U)
#define RF_FPGA_SDMIN_7_MSK    (((1U << RF_FPGA_SDMIN_7_LEN) - 1) << RF_FPGA_SDMIN_7_POS)
#define RF_FPGA_SDMIN_7_UMSK   (~(((1U << RF_FPGA_SDMIN_7_LEN) - 1) << RF_FPGA_SDMIN_7_POS))

/* 0x640 : rf_fpga_table_8 */
#define RF_FPGA_TABLE_8_OFFSET (0x640)
#define RF_FPGA_SDMIN_8        RF_FPGA_SDMIN_8
#define RF_FPGA_SDMIN_8_POS    (0U)
#define RF_FPGA_SDMIN_8_LEN    (30U)
#define RF_FPGA_SDMIN_8_MSK    (((1U << RF_FPGA_SDMIN_8_LEN) - 1) << RF_FPGA_SDMIN_8_POS)
#define RF_FPGA_SDMIN_8_UMSK   (~(((1U << RF_FPGA_SDMIN_8_LEN) - 1) << RF_FPGA_SDMIN_8_POS))

/* 0x644 : rf_fpga_table_9 */
#define RF_FPGA_TABLE_9_OFFSET (0x644)
#define RF_FPGA_SDMIN_9        RF_FPGA_SDMIN_9
#define RF_FPGA_SDMIN_9_POS    (0U)
#define RF_FPGA_SDMIN_9_LEN    (30U)
#define RF_FPGA_SDMIN_9_MSK    (((1U << RF_FPGA_SDMIN_9_LEN) - 1) << RF_FPGA_SDMIN_9_POS)
#define RF_FPGA_SDMIN_9_UMSK   (~(((1U << RF_FPGA_SDMIN_9_LEN) - 1) << RF_FPGA_SDMIN_9_POS))

