bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
/* 0x648 : rf_fpga_table_10 */
#define RF_FPGA_TABLE_10_OFFSET (0x648)
#define RF_FPGA_SDMIN_10        RF_FPGA_SDMIN_10
#define RF_FPGA_SDMIN_10_POS    (0U)
#define RF_FPGA_SDMIN_10_LEN    (30U)
#define RF_FPGA_SDMIN_10_MSK    (((1U << RF_FPGA_SDMIN_10_LEN) - 1) << RF_FPGA_SDMIN_10_POS)
#define RF_FPGA_SDMIN_10_UMSK   (~(((1U << RF_FPGA_SDMIN_10_LEN) - 1) << RF_FPGA_SDMIN_10_POS))

/* 0x64C : rf_fpga_table_11 */
#define RF_FPGA_TABLE_11_OFFSET (0x64C)
#define RF_FPGA_SDMIN_11        RF_FPGA_SDMIN_11
#define RF_FPGA_SDMIN_11_POS    (0U)
#define RF_FPGA_SDMIN_11_LEN    (30U)
#define RF_FPGA_SDMIN_11_MSK    (((1U << RF_FPGA_SDMIN_11_LEN) - 1) << RF_FPGA_SDMIN_11_POS)
#define RF_FPGA_SDMIN_11_UMSK   (~(((1U << RF_FPGA_SDMIN_11_LEN) - 1) << RF_FPGA_SDMIN_11_POS))

/* 0x650 : rf_fpga_table_12 */
#define RF_FPGA_TABLE_12_OFFSET (0x650)
#define RF_FPGA_SDMIN_12        RF_FPGA_SDMIN_12
#define RF_FPGA_SDMIN_12_POS    (0U)
#define RF_FPGA_SDMIN_12_LEN    (30U)
#define RF_FPGA_SDMIN_12_MSK    (((1U << RF_FPGA_SDMIN_12_LEN) - 1) << RF_FPGA_SDMIN_12_POS)
#define RF_FPGA_SDMIN_12_UMSK   (~(((1U << RF_FPGA_SDMIN_12_LEN) - 1) << RF_FPGA_SDMIN_12_POS))

/* 0x654 : rf_fpga_table_13 */
#define RF_FPGA_TABLE_13_OFFSET (0x654)
#define RF_FPGA_SDMIN_13        RF_FPGA_SDMIN_13
#define RF_FPGA_SDMIN_13_POS    (0U)
#define RF_FPGA_SDMIN_13_LEN    (30U)
#define RF_FPGA_SDMIN_13_MSK    (((1U << RF_FPGA_SDMIN_13_LEN) - 1) << RF_FPGA_SDMIN_13_POS)
#define RF_FPGA_SDMIN_13_UMSK   (~(((1U << RF_FPGA_SDMIN_13_LEN) - 1) << RF_FPGA_SDMIN_13_POS))

/* 0x658 : rf_fpga_table_14 */
#define RF_FPGA_TABLE_14_OFFSET (0x658)
#define RF_FPGA_SDMIN_14        RF_FPGA_SDMIN_14
#define RF_FPGA_SDMIN_14_POS    (0U)
#define RF_FPGA_SDMIN_14_LEN    (30U)
#define RF_FPGA_SDMIN_14_MSK    (((1U << RF_FPGA_SDMIN_14_LEN) - 1) << RF_FPGA_SDMIN_14_POS)
#define RF_FPGA_SDMIN_14_UMSK   (~(((1U << RF_FPGA_SDMIN_14_LEN) - 1) << RF_FPGA_SDMIN_14_POS))

/* 0x65C : rf_fpga_table_15 */
#define RF_FPGA_TABLE_15_OFFSET (0x65C)
#define RF_FPGA_SDMIN_15        RF_FPGA_SDMIN_15
#define RF_FPGA_SDMIN_15_POS    (0U)
#define RF_FPGA_SDMIN_15_LEN    (30U)
#define RF_FPGA_SDMIN_15_MSK    (((1U << RF_FPGA_SDMIN_15_LEN) - 1) << RF_FPGA_SDMIN_15_POS)
#define RF_FPGA_SDMIN_15_UMSK   (~(((1U << RF_FPGA_SDMIN_15_LEN) - 1) << RF_FPGA_SDMIN_15_POS))

/* 0x660 : rf_fpga_table_16 */
#define RF_FPGA_TABLE_16_OFFSET (0x660)
#define RF_FPGA_SDMIN_16        RF_FPGA_SDMIN_16
#define RF_FPGA_SDMIN_16_POS    (0U)
#define RF_FPGA_SDMIN_16_LEN    (30U)
#define RF_FPGA_SDMIN_16_MSK    (((1U << RF_FPGA_SDMIN_16_LEN) - 1) << RF_FPGA_SDMIN_16_POS)
#define RF_FPGA_SDMIN_16_UMSK   (~(((1U << RF_FPGA_SDMIN_16_LEN) - 1) << RF_FPGA_SDMIN_16_POS))

/* 0x664 : rf_fpga_table_17 */
#define RF_FPGA_TABLE_17_OFFSET (0x664)
#define RF_FPGA_SDMIN_17        RF_FPGA_SDMIN_17
#define RF_FPGA_SDMIN_17_POS    (0U)
#define RF_FPGA_SDMIN_17_LEN    (30U)
#define RF_FPGA_SDMIN_17_MSK    (((1U << RF_FPGA_SDMIN_17_LEN) - 1) << RF_FPGA_SDMIN_17_POS)
#define RF_FPGA_SDMIN_17_UMSK   (~(((1U << RF_FPGA_SDMIN_17_LEN) - 1) << RF_FPGA_SDMIN_17_POS))

/* 0x668 : rf_fpga_table_18 */
#define RF_FPGA_TABLE_18_OFFSET (0x668)
#define RF_FPGA_SDMIN_18        RF_FPGA_SDMIN_18
#define RF_FPGA_SDMIN_18_POS    (0U)
#define RF_FPGA_SDMIN_18_LEN    (30U)
#define RF_FPGA_SDMIN_18_MSK    (((1U << RF_FPGA_SDMIN_18_LEN) - 1) << RF_FPGA_SDMIN_18_POS)
#define RF_FPGA_SDMIN_18_UMSK   (~(((1U << RF_FPGA_SDMIN_18_LEN) - 1) << RF_FPGA_SDMIN_18_POS))

/* 0x66C : rf_fpga_table_19 */
#define RF_FPGA_TABLE_19_OFFSET (0x66C)
#define RF_FPGA_SDMIN_19        RF_FPGA_SDMIN_19
#define RF_FPGA_SDMIN_19_POS    (0U)
#define RF_FPGA_SDMIN_19_LEN    (30U)
#define RF_FPGA_SDMIN_19_MSK    (((1U << RF_FPGA_SDMIN_19_LEN) - 1) << RF_FPGA_SDMIN_19_POS)
#define RF_FPGA_SDMIN_19_UMSK   (~(((1U << RF_FPGA_SDMIN_19_LEN) - 1) << RF_FPGA_SDMIN_19_POS))

/* 0x670 : rf_fpga_table_20 */
#define RF_FPGA_TABLE_20_OFFSET (0x670)
#define RF_FPGA_SDMIN_20        RF_FPGA_SDMIN_20
#define RF_FPGA_SDMIN_20_POS    (0U)
#define RF_FPGA_SDMIN_20_LEN    (30U)
#define RF_FPGA_SDMIN_20_MSK    (((1U << RF_FPGA_SDMIN_20_LEN) - 1) << RF_FPGA_SDMIN_20_POS)
#define RF_FPGA_SDMIN_20_UMSK   (~(((1U << RF_FPGA_SDMIN_20_LEN) - 1) << RF_FPGA_SDMIN_20_POS))

/* 0x674 : rf_fpga_table_21 */
#define RF_FPGA_TABLE_21_OFFSET (0x674)
#define RF_FPGA_SDMIN_21        RF_FPGA_SDMIN_21
#define RF_FPGA_SDMIN_21_POS    (0U)
#define RF_FPGA_SDMIN_21_LEN    (30U)
#define RF_FPGA_SDMIN_21_MSK    (((1U << RF_FPGA_SDMIN_21_LEN) - 1) << RF_FPGA_SDMIN_21_POS)
#define RF_FPGA_SDMIN_21_UMSK   (~(((1U << RF_FPGA_SDMIN_21_LEN) - 1) << RF_FPGA_SDMIN_21_POS))

/* 0x678 : rf_fpga_table_22 */
#define RF_FPGA_TABLE_22_OFFSET (0x678)
#define RF_FPGA_SDMIN_22        RF_FPGA_SDMIN_22
#define RF_FPGA_SDMIN_22_POS    (0U)
#define RF_FPGA_SDMIN_22_LEN    (30U)
#define RF_FPGA_SDMIN_22_MSK    (((1U << RF_FPGA_SDMIN_22_LEN) - 1) << RF_FPGA_SDMIN_22_POS)
#define RF_FPGA_SDMIN_22_UMSK   (~(((1U << RF_FPGA_SDMIN_22_LEN) - 1) << RF_FPGA_SDMIN_22_POS))

/* 0x67C : rf_fpga_table_23 */
#define RF_FPGA_TABLE_23_OFFSET (0x67C)
#define RF_FPGA_SDMIN_23        RF_FPGA_SDMIN_23
#define RF_FPGA_SDMIN_23_POS    (0U)
#define RF_FPGA_SDMIN_23_LEN    (30U)
#define RF_FPGA_SDMIN_23_MSK    (((1U << RF_FPGA_SDMIN_23_LEN) - 1) << RF_FPGA_SDMIN_23_POS)
#define RF_FPGA_SDMIN_23_UMSK   (~(((1U << RF_FPGA_SDMIN_23_LEN) - 1) << RF_FPGA_SDMIN_23_POS))

/* 0x680 : rf_fpga_table_24 */
#define RF_FPGA_TABLE_24_OFFSET (0x680)
#define RF_FPGA_SDMIN_24        RF_FPGA_SDMIN_24
#define RF_FPGA_SDMIN_24_POS    (0U)
#define RF_FPGA_SDMIN_24_LEN    (30U)
#define RF_FPGA_SDMIN_24_MSK    (((1U << RF_FPGA_SDMIN_24_LEN) - 1) << RF_FPGA_SDMIN_24_POS)
#define RF_FPGA_SDMIN_24_UMSK   (~(((1U << RF_FPGA_SDMIN_24_LEN) - 1) << RF_FPGA_SDMIN_24_POS))

/* 0x684 : rf_fpga_table_25 */
#define RF_FPGA_TABLE_25_OFFSET (0x684)
#define RF_FPGA_SDMIN_25        RF_FPGA_SDMIN_25
#define RF_FPGA_SDMIN_25_POS    (0U)
#define RF_FPGA_SDMIN_25_LEN    (30U)
#define RF_FPGA_SDMIN_25_MSK    (((1U << RF_FPGA_SDMIN_25_LEN) - 1) << RF_FPGA_SDMIN_25_POS)
#define RF_FPGA_SDMIN_25_UMSK   (~(((1U << RF_FPGA_SDMIN_25_LEN) - 1) << RF_FPGA_SDMIN_25_POS))

/* 0x688 : rf_fpga_table_26 */
#define RF_FPGA_TABLE_26_OFFSET (0x688)
#define RF_FPGA_SDMIN_26        RF_FPGA_SDMIN_26
#define RF_FPGA_SDMIN_26_POS    (0U)
#define RF_FPGA_SDMIN_26_LEN    (30U)
#define RF_FPGA_SDMIN_26_MSK    (((1U << RF_FPGA_SDMIN_26_LEN) - 1) << RF_FPGA_SDMIN_26_POS)
#define RF_FPGA_SDMIN_26_UMSK   (~(((1U << RF_FPGA_SDMIN_26_LEN) - 1) << RF_FPGA_SDMIN_26_POS))

/* 0x68C : rf_fpga_table_27 */
#define RF_FPGA_TABLE_27_OFFSET (0x68C)
#define RF_FPGA_SDMIN_27        RF_FPGA_SDMIN_27
#define RF_FPGA_SDMIN_27_POS    (0U)
#define RF_FPGA_SDMIN_27_LEN    (30U)
#define RF_FPGA_SDMIN_27_MSK    (((1U << RF_FPGA_SDMIN_27_LEN) - 1) << RF_FPGA_SDMIN_27_POS)
#define RF_FPGA_SDMIN_27_UMSK   (~(((1U << RF_FPGA_SDMIN_27_LEN) - 1) << RF_FPGA_SDMIN_27_POS))

/* 0x690 : rf_fpga_table_28 */
#define RF_FPGA_TABLE_28_OFFSET (0x690)
#define RF_FPGA_SDMIN_28        RF_FPGA_SDMIN_28
#define RF_FPGA_SDMIN_28_POS    (0U)
#define RF_FPGA_SDMIN_28_LEN    (30U)
#define RF_FPGA_SDMIN_28_MSK    (((1U << RF_FPGA_SDMIN_28_LEN) - 1) << RF_FPGA_SDMIN_28_POS)
#define RF_FPGA_SDMIN_28_UMSK   (~(((1U << RF_FPGA_SDMIN_28_LEN) - 1) << RF_FPGA_SDMIN_28_POS))

/* 0x694 : rf_fpga_table_29 */
#define RF_FPGA_TABLE_29_OFFSET (0x694)
#define RF_FPGA_SDMIN_29        RF_FPGA_SDMIN_29
#define RF_FPGA_SDMIN_29_POS    (0U)
#define RF_FPGA_SDMIN_29_LEN    (30U)
#define RF_FPGA_SDMIN_29_MSK    (((1U << RF_FPGA_SDMIN_29_LEN) - 1) << RF_FPGA_SDMIN_29_POS)
#define RF_FPGA_SDMIN_29_UMSK   (~(((1U << RF_FPGA_SDMIN_29_LEN) - 1) << RF_FPGA_SDMIN_29_POS))

/* 0x698 : rf_fpga_table_30 */
#define RF_FPGA_TABLE_30_OFFSET (0x698)
#define RF_FPGA_SDMIN_30        RF_FPGA_SDMIN_30
#define RF_FPGA_SDMIN_30_POS    (0U)
#define RF_FPGA_SDMIN_30_LEN    (30U)
#define RF_FPGA_SDMIN_30_MSK    (((1U << RF_FPGA_SDMIN_30_LEN) - 1) << RF_FPGA_SDMIN_30_POS)
#define RF_FPGA_SDMIN_30_UMSK   (~(((1U << RF_FPGA_SDMIN_30_LEN) - 1) << RF_FPGA_SDMIN_30_POS))

