bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
/* 0x69C : rf_fpga_table_31 */
#define RF_FPGA_TABLE_31_OFFSET (0x69C)
#define RF_FPGA_SDMIN_31        RF_FPGA_SDMIN_31
#define RF_FPGA_SDMIN_31_POS    (0U)
#define RF_FPGA_SDMIN_31_LEN    (30U)
#define RF_FPGA_SDMIN_31_MSK    (((1U << RF_FPGA_SDMIN_31_LEN) - 1) << RF_FPGA_SDMIN_31_POS)
#define RF_FPGA_SDMIN_31_UMSK   (~(((1U << RF_FPGA_SDMIN_31_LEN) - 1) << RF_FPGA_SDMIN_31_POS))

/* 0x6A0 : rf_fpga_table_32 */
#define RF_FPGA_TABLE_32_OFFSET (0x6A0)
#define RF_FPGA_SDMIN_32        RF_FPGA_SDMIN_32
#define RF_FPGA_SDMIN_32_POS    (0U)
#define RF_FPGA_SDMIN_32_LEN    (30U)
#define RF_FPGA_SDMIN_32_MSK    (((1U << RF_FPGA_SDMIN_32_LEN) - 1) << RF_FPGA_SDMIN_32_POS)
#define RF_FPGA_SDMIN_32_UMSK   (~(((1U << RF_FPGA_SDMIN_32_LEN) - 1) << RF_FPGA_SDMIN_32_POS))

/* 0x6A4 : rf_fpga_table_33 */
#define RF_FPGA_TABLE_33_OFFSET (0x6A4)
#define RF_FPGA_SDMIN_33        RF_FPGA_SDMIN_33
#define RF_FPGA_SDMIN_33_POS    (0U)
#define RF_FPGA_SDMIN_33_LEN    (30U)
#define RF_FPGA_SDMIN_33_MSK    (((1U << RF_FPGA_SDMIN_33_LEN) - 1) << RF_FPGA_SDMIN_33_POS)
#define RF_FPGA_SDMIN_33_UMSK   (~(((1U << RF_FPGA_SDMIN_33_LEN) - 1) << RF_FPGA_SDMIN_33_POS))

/* 0x6A8 : rf_fpga_table_34 */
#define RF_FPGA_TABLE_34_OFFSET (0x6A8)
#define RF_FPGA_SDMIN_34        RF_FPGA_SDMIN_34
#define RF_FPGA_SDMIN_34_POS    (0U)
#define RF_FPGA_SDMIN_34_LEN    (30U)
#define RF_FPGA_SDMIN_34_MSK    (((1U << RF_FPGA_SDMIN_34_LEN) - 1) << RF_FPGA_SDMIN_34_POS)
#define RF_FPGA_SDMIN_34_UMSK   (~(((1U << RF_FPGA_SDMIN_34_LEN) - 1) << RF_FPGA_SDMIN_34_POS))

/* 0x6AC : rf_fpga_table_35 */
#define RF_FPGA_TABLE_35_OFFSET (0x6AC)
#define RF_FPGA_SDMIN_35        RF_FPGA_SDMIN_35
#define RF_FPGA_SDMIN_35_POS    (0U)
#define RF_FPGA_SDMIN_35_LEN    (30U)
#define RF_FPGA_SDMIN_35_MSK    (((1U << RF_FPGA_SDMIN_35_LEN) - 1) << RF_FPGA_SDMIN_35_POS)
#define RF_FPGA_SDMIN_35_UMSK   (~(((1U << RF_FPGA_SDMIN_35_LEN) - 1) << RF_FPGA_SDMIN_35_POS))

/* 0x6B0 : rf_fpga_table_36 */
#define RF_FPGA_TABLE_36_OFFSET (0x6B0)
#define RF_FPGA_SDMIN_36        RF_FPGA_SDMIN_36
#define RF_FPGA_SDMIN_36_POS    (0U)
#define RF_FPGA_SDMIN_36_LEN    (30U)
#define RF_FPGA_SDMIN_36_MSK    (((1U << RF_FPGA_SDMIN_36_LEN) - 1) << RF_FPGA_SDMIN_36_POS)
#define RF_FPGA_SDMIN_36_UMSK   (~(((1U << RF_FPGA_SDMIN_36_LEN) - 1) << RF_FPGA_SDMIN_36_POS))

/* 0x6B4 : rf_fpga_table_37 */
#define RF_FPGA_TABLE_37_OFFSET (0x6B4)
#define RF_FPGA_SDMIN_37        RF_FPGA_SDMIN_37
#define RF_FPGA_SDMIN_37_POS    (0U)
#define RF_FPGA_SDMIN_37_LEN    (30U)
#define RF_FPGA_SDMIN_37_MSK    (((1U << RF_FPGA_SDMIN_37_LEN) - 1) << RF_FPGA_SDMIN_37_POS)
#define RF_FPGA_SDMIN_37_UMSK   (~(((1U << RF_FPGA_SDMIN_37_LEN) - 1) << RF_FPGA_SDMIN_37_POS))

/* 0x6B8 : rf_fpga_table_38 */
#define RF_FPGA_TABLE_38_OFFSET (0x6B8)
#define RF_FPGA_SDMIN_38        RF_FPGA_SDMIN_38
#define RF_FPGA_SDMIN_38_POS    (0U)
#define RF_FPGA_SDMIN_38_LEN    (30U)
#define RF_FPGA_SDMIN_38_MSK    (((1U << RF_FPGA_SDMIN_38_LEN) - 1) << RF_FPGA_SDMIN_38_POS)
#define RF_FPGA_SDMIN_38_UMSK   (~(((1U << RF_FPGA_SDMIN_38_LEN) - 1) << RF_FPGA_SDMIN_38_POS))

/* 0x6BC : rf_fpga_table_39 */
#define RF_FPGA_TABLE_39_OFFSET (0x6BC)
#define RF_FPGA_SDMIN_39        RF_FPGA_SDMIN_39
#define RF_FPGA_SDMIN_39_POS    (0U)
#define RF_FPGA_SDMIN_39_LEN    (30U)
#define RF_FPGA_SDMIN_39_MSK    (((1U << RF_FPGA_SDMIN_39_LEN) - 1) << RF_FPGA_SDMIN_39_POS)
#define RF_FPGA_SDMIN_39_UMSK   (~(((1U << RF_FPGA_SDMIN_39_LEN) - 1) << RF_FPGA_SDMIN_39_POS))

/* 0x6C0 : rf_fpga_table_40 */
#define RF_FPGA_TABLE_40_OFFSET (0x6C0)
#define RF_FPGA_SDMIN_40        RF_FPGA_SDMIN_40
#define RF_FPGA_SDMIN_40_POS    (0U)
#define RF_FPGA_SDMIN_40_LEN    (30U)
#define RF_FPGA_SDMIN_40_MSK    (((1U << RF_FPGA_SDMIN_40_LEN) - 1) << RF_FPGA_SDMIN_40_POS)
#define RF_FPGA_SDMIN_40_UMSK   (~(((1U << RF_FPGA_SDMIN_40_LEN) - 1) << RF_FPGA_SDMIN_40_POS))

/* 0x6C4 : rf_fpga_table_41 */
#define RF_FPGA_TABLE_41_OFFSET (0x6C4)
#define RF_FPGA_SDMIN_41        RF_FPGA_SDMIN_41
#define RF_FPGA_SDMIN_41_POS    (0U)
#define RF_FPGA_SDMIN_41_LEN    (30U)
#define RF_FPGA_SDMIN_41_MSK    (((1U << RF_FPGA_SDMIN_41_LEN) - 1) << RF_FPGA_SDMIN_41_POS)
#define RF_FPGA_SDMIN_41_UMSK   (~(((1U << RF_FPGA_SDMIN_41_LEN) - 1) << RF_FPGA_SDMIN_41_POS))

/* 0x6C8 : rf_fpga_table_42 */
#define RF_FPGA_TABLE_42_OFFSET (0x6C8)
#define RF_FPGA_SDMIN_42        RF_FPGA_SDMIN_42
#define RF_FPGA_SDMIN_42_POS    (0U)
#define RF_FPGA_SDMIN_42_LEN    (30U)
#define RF_FPGA_SDMIN_42_MSK    (((1U << RF_FPGA_SDMIN_42_LEN) - 1) << RF_FPGA_SDMIN_42_POS)
#define RF_FPGA_SDMIN_42_UMSK   (~(((1U << RF_FPGA_SDMIN_42_LEN) - 1) << RF_FPGA_SDMIN_42_POS))

/* 0x6CC : rf_fpga_table_43 */
#define RF_FPGA_TABLE_43_OFFSET (0x6CC)
#define RF_FPGA_SDMIN_43        RF_FPGA_SDMIN_43
#define RF_FPGA_SDMIN_43_POS    (0U)
#define RF_FPGA_SDMIN_43_LEN    (30U)
#define RF_FPGA_SDMIN_43_MSK    (((1U << RF_FPGA_SDMIN_43_LEN) - 1) << RF_FPGA_SDMIN_43_POS)
#define RF_FPGA_SDMIN_43_UMSK   (~(((1U << RF_FPGA_SDMIN_43_LEN) - 1) << RF_FPGA_SDMIN_43_POS))

/* 0x6D0 : rf_fpga_table_44 */
#define RF_FPGA_TABLE_44_OFFSET (0x6D0)
#define RF_FPGA_SDMIN_44        RF_FPGA_SDMIN_44
#define RF_FPGA_SDMIN_44_POS    (0U)
#define RF_FPGA_SDMIN_44_LEN    (30U)
#define RF_FPGA_SDMIN_44_MSK    (((1U << RF_FPGA_SDMIN_44_LEN) - 1) << RF_FPGA_SDMIN_44_POS)
#define RF_FPGA_SDMIN_44_UMSK   (~(((1U << RF_FPGA_SDMIN_44_LEN) - 1) << RF_FPGA_SDMIN_44_POS))

/* 0x6D4 : rf_fpga_table_45 */
#define RF_FPGA_TABLE_45_OFFSET (0x6D4)
#define RF_FPGA_SDMIN_45        RF_FPGA_SDMIN_45
#define RF_FPGA_SDMIN_45_POS    (0U)
#define RF_FPGA_SDMIN_45_LEN    (30U)
#define RF_FPGA_SDMIN_45_MSK    (((1U << RF_FPGA_SDMIN_45_LEN) - 1) << RF_FPGA_SDMIN_45_POS)
#define RF_FPGA_SDMIN_45_UMSK   (~(((1U << RF_FPGA_SDMIN_45_LEN) - 1) << RF_FPGA_SDMIN_45_POS))

/* 0x6D8 : rf_fpga_table_46 */
#define RF_FPGA_TABLE_46_OFFSET (0x6D8)
#define RF_FPGA_SDMIN_46        RF_FPGA_SDMIN_46
#define RF_FPGA_SDMIN_46_POS    (0U)
#define RF_FPGA_SDMIN_46_LEN    (30U)
#define RF_FPGA_SDMIN_46_MSK    (((1U << RF_FPGA_SDMIN_46_LEN) - 1) << RF_FPGA_SDMIN_46_POS)
#define RF_FPGA_SDMIN_46_UMSK   (~(((1U << RF_FPGA_SDMIN_46_LEN) - 1) << RF_FPGA_SDMIN_46_POS))

