bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
    /* 0x668 : rf_fpga_table_18 */
    union {
        struct
        {
            uint32_t sdmin_18       : 30; /* [29: 0],        r/w, 0x1529c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_18;

    /* 0x66C : rf_fpga_table_19 */
    union {
        struct
        {
            uint32_t sdmin_19       : 30; /* [29: 0],        r/w, 0x152e38e3 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_19;

    /* 0x670 : rf_fpga_table_20 */
    union {
        struct
        {
            uint32_t sdmin_20       : 30; /* [29: 0],        r/w, 0x1532aaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_20;

    /* 0x674 : rf_fpga_table_21 */
    union {
        struct
        {
            uint32_t sdmin_21       : 30; /* [29: 0],        r/w, 0x15371c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_21;

    /* 0x678 : rf_fpga_table_22 */
    union {
        struct
        {
            uint32_t sdmin_22       : 30; /* [29: 0],        r/w, 0x153b8e38 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_22;

    /* 0x67C : rf_fpga_table_23 */
    union {
        struct
        {
            uint32_t sdmin_23       : 30; /* [29: 0],        r/w, 0x15400000 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_23;

    /* 0x680 : rf_fpga_table_24 */
    union {
        struct
        {
            uint32_t sdmin_24       : 30; /* [29: 0],        r/w, 0x154471c7 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_24;

    /* 0x684 : rf_fpga_table_25 */
    union {
        struct
        {
            uint32_t sdmin_25       : 30; /* [29: 0],        r/w, 0x1548e38e */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_25;

    /* 0x688 : rf_fpga_table_26 */
    union {
        struct
        {
            uint32_t sdmin_26       : 30; /* [29: 0],        r/w, 0x154d5555 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_26;

    /* 0x68C : rf_fpga_table_27 */
    union {
        struct
        {
            uint32_t sdmin_27       : 30; /* [29: 0],        r/w, 0x1551c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_27;

    /* 0x690 : rf_fpga_table_28 */
    union {
        struct
        {
            uint32_t sdmin_28       : 30; /* [29: 0],        r/w, 0x155638e3 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_28;

    /* 0x694 : rf_fpga_table_29 */
    union {
        struct
        {
            uint32_t sdmin_29       : 30; /* [29: 0],        r/w, 0x155aaaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_29;

    /* 0x698 : rf_fpga_table_30 */
    union {
        struct
        {
            uint32_t sdmin_30       : 30; /* [29: 0],        r/w, 0x155f1c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_30;

    /* 0x69C : rf_fpga_table_31 */
    union {
        struct
        {
            uint32_t sdmin_31       : 30; /* [29: 0],        r/w, 0x15638e38 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_31;

    /* 0x6A0 : rf_fpga_table_32 */
    union {
        struct
        {
            uint32_t sdmin_32       : 30; /* [29: 0],        r/w, 0x15680000 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_32;

    /* 0x6A4 : rf_fpga_table_33 */
    union {
        struct
        {
            uint32_t sdmin_33       : 30; /* [29: 0],        r/w, 0x156c71c7 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_33;

    /* 0x6A8 : rf_fpga_table_34 */
    union {
        struct
        {
            uint32_t sdmin_34       : 30; /* [29: 0],        r/w, 0x1570e38e */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_34;

    /* 0x6AC : rf_fpga_table_35 */
    union {
        struct
        {
            uint32_t sdmin_35       : 30; /* [29: 0],        r/w, 0x15755555 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_35;

    /* 0x6B0 : rf_fpga_table_36 */
    union {
        struct
        {
            uint32_t sdmin_36       : 30; /* [29: 0],        r/w, 0x1579c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_36;

    /* 0x6B4 : rf_fpga_table_37 */
    union {
        struct
        {
            uint32_t sdmin_37       : 30; /* [29: 0],        r/w, 0x157e38e3 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_37;

    /* 0x6B8 : rf_fpga_table_38 */
    union {
        struct
        {
            uint32_t sdmin_38       : 30; /* [29: 0],        r/w, 0x1582aaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_38;

    /* 0x6BC : rf_fpga_table_39 */
    union {
        struct
        {
            uint32_t sdmin_39       : 30; /* [29: 0],        r/w, 0x15871c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_39;

    /* 0x6C0 : rf_fpga_table_40 */
    union {
        struct
        {
            uint32_t sdmin_40       : 30; /* [29: 0],        r/w, 0x14e071c7 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_40;

    /* 0x6C4 : rf_fpga_table_41 */
    union {
        struct
        {
            uint32_t sdmin_41       : 30; /* [29: 0],        r/w, 0x14f6aaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_41;

    /* 0x6C8 : rf_fpga_table_42 */
    union {
        struct
        {
            uint32_t sdmin_42       : 30; /* [29: 0],        r/w, 0x150ce38e */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_42;

