bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
    /* 0x6FC : rf_fpga_table_55 */
    union {
        struct
        {
            uint32_t freq_cw_31  : 7; /* [ 6: 0],        r/w,       0x21 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_30  : 7; /* [14: 8],        r/w,       0x21 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_29  : 7; /* [22:16],        r/w,       0x22 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_28  : 7; /* [30:24],        r/w,       0x22 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_55;

    /* 0x700 : rf_fpga_table_56 */
    union {
        struct
        {
            uint32_t freq_cw_35  : 7; /* [ 6: 0],        r/w,       0x20 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_34  : 7; /* [14: 8],        r/w,       0x20 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_33  : 7; /* [22:16],        r/w,       0x21 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_32  : 7; /* [30:24],        r/w,       0x21 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_56;

    /* 0x704 : rf_fpga_table_57 */
    union {
        struct
        {
            uint32_t freq_cw_39  : 7; /* [ 6: 0],        r/w,       0x1f */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_38  : 7; /* [14: 8],        r/w,       0x1f */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_37  : 7; /* [22:16],        r/w,       0x20 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_36  : 7; /* [30:24],        r/w,       0x20 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_57;

    /* 0x708 : rf_fpga_table_58 */
    union {
        struct
        {
            uint32_t freq_cw_43  : 7; /* [ 6: 0],        r/w,       0x25 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_42  : 7; /* [14: 8],        r/w,       0x26 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_41  : 7; /* [22:16],        r/w,       0x28 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_40  : 7; /* [30:24],        r/w,       0x29 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_58;

    /* 0x70C : rf_fpga_table_59 */
    union {
        struct
        {
            uint32_t freq_cw_47  : 7; /* [ 6: 0],        r/w,       0x20 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_46  : 7; /* [14: 8],        r/w,       0x21 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_45  : 7; /* [22:16],        r/w,       0x22 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_44  : 7; /* [30:24],        r/w,       0x24 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_59;

    /* 0x710 : rf_fpga_ctrl_8 */
    union {
        struct
        {
            uint32_t cmd_enable     : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_8;

    /* 0x714 : rf_fpga_table_60 */
    union {
        struct
        {
            uint32_t freq_cw_rx_3 : 7; /* [ 6: 0],        r/w,       0x29 */
            uint32_t reserved_7   : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_2 : 7; /* [14: 8],        r/w,       0x29 */
            uint32_t reserved_15  : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_1 : 7; /* [22:16],        r/w,       0x29 */
            uint32_t reserved_23  : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_0 : 7; /* [30:24],        r/w,       0x2a */
            uint32_t reserved_31  : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_60;

    /* 0x718 : rf_fpga_table_61 */
    union {
        struct
        {
            uint32_t freq_cw_rx_7 : 7; /* [ 6: 0],        r/w,       0x28 */
            uint32_t reserved_7   : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_6 : 7; /* [14: 8],        r/w,       0x28 */
            uint32_t reserved_15  : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_5 : 7; /* [22:16],        r/w,       0x28 */
            uint32_t reserved_23  : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_4 : 7; /* [30:24],        r/w,       0x29 */
            uint32_t reserved_31  : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_61;

    /* 0x71C : rf_fpga_table_62 */
    union {
        struct
        {
            uint32_t freq_cw_rx_11 : 7; /* [ 6: 0],        r/w,       0x27 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_10 : 7; /* [14: 8],        r/w,       0x27 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_9  : 7; /* [22:16],        r/w,       0x27 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_8  : 7; /* [30:24],        r/w,       0x27 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_62;

    /* 0x720 : rf_fpga_table_63 */
    union {
        struct
        {
            uint32_t freq_cw_rx_15 : 7; /* [ 6: 0],        r/w,       0x25 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_14 : 7; /* [14: 8],        r/w,       0x26 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_13 : 7; /* [22:16],        r/w,       0x26 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_12 : 7; /* [30:24],        r/w,       0x26 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_63;

