bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_fpga_reg.h
    /* 0x724 : rf_fpga_table_64 */
    union {
        struct
        {
            uint32_t freq_cw_rx_19 : 7; /* [ 6: 0],        r/w,       0x24 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_18 : 7; /* [14: 8],        r/w,       0x25 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_17 : 7; /* [22:16],        r/w,       0x25 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_16 : 7; /* [30:24],        r/w,       0x25 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_64;

    /* 0x728 : rf_fpga_table_65 */
    union {
        struct
        {
            uint32_t freq_cw_rx_23 : 7; /* [ 6: 0],        r/w,       0x23 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_22 : 7; /* [14: 8],        r/w,       0x24 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_21 : 7; /* [22:16],        r/w,       0x24 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_20 : 7; /* [30:24],        r/w,       0x24 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_65;

    /* 0x72C : rf_fpga_table_66 */
    union {
        struct
        {
            uint32_t freq_cw_rx_27 : 7; /* [ 6: 0],        r/w,       0x22 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_26 : 7; /* [14: 8],        r/w,       0x22 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_25 : 7; /* [22:16],        r/w,       0x23 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_24 : 7; /* [30:24],        r/w,       0x23 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_66;

    /* 0x730 : rf_fpga_table_67 */
    union {
        struct
        {
            uint32_t freq_cw_rx_31 : 7; /* [ 6: 0],        r/w,       0x21 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_30 : 7; /* [14: 8],        r/w,       0x21 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_29 : 7; /* [22:16],        r/w,       0x22 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_28 : 7; /* [30:24],        r/w,       0x22 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_67;

    /* 0x734 : rf_fpga_table_68 */
    union {
        struct
        {
            uint32_t freq_cw_rx_35 : 7; /* [ 6: 0],        r/w,       0x20 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_34 : 7; /* [14: 8],        r/w,       0x20 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_33 : 7; /* [22:16],        r/w,       0x21 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_32 : 7; /* [30:24],        r/w,       0x21 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_68;

    /* 0x738 : rf_fpga_table_69 */
    union {
        struct
        {
            uint32_t freq_cw_rx_39 : 7; /* [ 6: 0],        r/w,       0x1f */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_38 : 7; /* [14: 8],        r/w,       0x1f */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_37 : 7; /* [22:16],        r/w,       0x20 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_36 : 7; /* [30:24],        r/w,       0x20 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_69;

    /* 0x73C : rf_fpga_table_70 */
    union {
        struct
        {
            uint32_t freq_cw_rx_43 : 7; /* [ 6: 0],        r/w,       0x25 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_42 : 7; /* [14: 8],        r/w,       0x26 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_41 : 7; /* [22:16],        r/w,       0x28 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_40 : 7; /* [30:24],        r/w,       0x29 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_70;

    /* 0x740 : rf_fpga_table_71 */
    union {
        struct
        {
            uint32_t freq_cw_rx_47 : 7; /* [ 6: 0],        r/w,       0x20 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_rx_46 : 7; /* [14: 8],        r/w,       0x21 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_rx_45 : 7; /* [22:16],        r/w,       0x22 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_rx_44 : 7; /* [30:24],        r/w,       0x24 */
            uint32_t reserved_31   : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_71;
};

typedef volatile struct rf_fpga_reg rf_fpga_reg_t;

#endif /* __RF_FPGA_REG_H__ */
